{
    "ski_lls": [
     "String",
    "Integer",
    "Float (floating point numbers - also called double)",
    "Boolean",
    "Array",
    "Object",
    "NULL",
    "Resource"
 ],
  
    "common_string":[
        "strlen() - Returns the length of a string.",
        "strpos() - Finds the position of the first occurrence of a substring in a string.",
        "str_replace() - Replaces all occurrences of a search string with a replacement string.",
        "substr() - Returns a portion of a string.",
        "trim() - Strips whitespace (or other characters) from the beginning and end of a string.",
        "strtolower() - Converts all characters in a string to lowercase.",
        "strtoupper() - Converts all characters in a string to uppercase.",
        "explode() - Splits a string into an array by a specified delimiter.",
        "implode() - Joins array elements into a single string using a delimiter",
        "htmlspecialchars() - Converts special characters to HTML entities.",
        "md5() - Calculates the MD5 hash of a string.",
        "sha1() - Calculates the SHA-1 hash of a string.",
        "strrev() - Reverses a string.",
        "nl2br() - Inserts HTML line breaks before all newlines in a string.",
        "strcmp() - Compares two strings (case-sensitive).",
        "strcasecmp() - Compares two strings (case-insensitive).",
        "stristr() - Finds the first occurrence of a string inside another string (case-insensitive).",
        "str_repeat() - Repeats a string a specified number of times.",
        "ucfirst() - Converts the first character of a string to uppercase.",
        "ucwords() - Converts the first character of each word in a string to uppercase.",
        "addslashes() - Adds backslashes before characters that need to be escaped.",
        "strip_tags() - Strips HTML and PHP tags from a string.",
        "strstr() - Finds the first occurrence of a string within another string.",
        "wordwrap() - Wraps a string to a given number of characters.",
        "parse_str() - Parses a query string into variables."
    ],

    "array_type":{
        "Indexed_arrays": "- Arrays with a numeric index",
        "Associative_arrays": "-Arrays with named keys",
        "Multidimensional_arrays": "-Arrays containing one or more arrays"      
    }

}
